# Jupyter Commands

-- Import pandas into Jupyter notebook then load in a CSV file. 
You also could use json, excel per steps: 

import pandas as pd
testdata = pd.read_json('/Users/jess/python/firsttest/data1.json')
or
import pandas as pd
testdata = pd.read_excel('/Users/jess/python/firsttest/data1.xlsx')

references: 

(1) https://ordinarycoders.com/blog/article/25-python-commands-jupyter-notebook

(2) https://www.shanelynn.ie/pandas-drop-delete-dataframe-rows-columns/

In [1]:
import pandas as pd

-- Next read the csv file

In [79]:
pd.read_csv('data1.csv')

,Months,Region Midwest,Region Northeast,Region South,Region West,fake-_column
0,Feb,22,45,27,37,2
1,Mar,28,38,43,26,3
2,Apr,27,37,38,25,4
3,May,26,35,41,31,5
4,Jun,22,31,39,25,6
5,Total,125,186,188,144,20

-- Check current file path with "pwd" then copy & paste

pwd

-- Create a variable like "testdata" and set it to file path. This allows easy use of "testdata" instead of long file path name.

In [87]:
df= pd.read_csv('/Users/jess/python/firsttest/data1.csv')

-- Examine the first 5 rows using head()

In [82]:
df.head()

,Months,Region Midwest,Region Northeast,Region South,Region West,fake-_column
0,Feb,22,45,27,37,2
1,Mar,28,38,43,26,3
2,Apr,27,37,38,25,4
3,May,26,35,41,31,5
4,Jun,22,31,39,25,6

-- Get a list of commands us lsmagic

In [14]:
lsmagic

Available line magics:
%alias  %alias_magic  %autoawait  %autocall  %automagic  %autosave  %bookmark  %cat  %cd  %clear  %colors  %conda  %config  %connect_info  %cp  %debug  %dhist  %dirs  %doctest_mode  %ed  %edit  %env  %gui  %hist  %history  %killbgscripts  %ldir  %less  %lf  %lk  %ll  %load  %load_ext  %loadpy  %logoff  %logon  %logstart  %logstate  %logstop  %ls  %lsmagic  %lx  %macro  %magic  %man  %matplotlib  %mkdir  %more  %mv  %notebook  %page  %pastebin  %pdb  %pdef  %pdoc  %pfile  %pinfo  %pinfo2  %pip  %popd  %pprint  %precision  %prun  %psearch  %psource  %pushd  %pwd  %pycat  %pylab  %qtconsole  %quickref  %recall  %rehashx  %reload_ext  %rep  %rerun  %reset  %reset_selective  %rm  %rmdir  %run  %save  %sc  %set_env  %store  %sx  %system  %tb  %time  %timeit  %unalias  %unload_ext  %who  %who_ls  %whos  %xdel  %xmode

Available cell magics:
%%!  %%HTML  %%SVG  %%bash  %%capture  %%debug  %%file  %%html  %%javascript  %%js  %%latex  %%markdown  %%perl  %%prun  %%pypy  %%python  %%python2  %%python3  %%ruby  %%script  %%sh  %%svg  %%sx  %%system  %%time  %%timeit  %%writefile

Automagic is ON, % prefix IS NOT needed for line magics.

In [83]:
who

df	 df2	 division	 np	 pd	 print_function	 testdata

-- View columns with .columns command

In [84]:
df.columns

Index(['Months', 'Region Midwest', 'Region Northeast', 'Region South',
       'Region West', 'fake-_column'],
      dtype='object')

-- Display one specific column or multiple columns by calling on their names.

In [106]:
df[['Region South', 'Months']]

   Region South Months
0            27    Feb
1            43    Mar
2            38    Apr
3            41    May
4            39    Jun
5           188  Total

-- Use .sort_values to display the data frame alphabetically by the column specified. Add ascending=False to sort by descending alphabetical order.

In [88]:
df.sort_values('Months', ascending=False)

,Months,Region Midwest,Region Northeast,Region South,Region West,fake-_column
5,Total,125,186,188,144,20
3,May,26,35,41,31,5
1,Mar,28,38,43,26,3
4,Jun,22,31,39,25,6
0,Feb,22,45,27,37,2
2,Apr,27,37,38,25,4

-- Drops a column called 'fake-_column' specified from the data set.

In [108]:
df = df.drop(columns = ['fake-_column'])

In [109]:
df.columns

Index(['Months', 'Region Midwest', 'Region Northeast', 'Region South',
       'Region West'],
      dtype='object')

In [110]:
df.sort_values('Months', ascending=False)

  Months  Region Midwest  Region Northeast  Region South  Region West
5  Total             125               186           188          144
3    May              26                35            41           31
1    Mar              28                38            43           26
4    Jun              22                31            39           25
0    Feb              22                45            27           37
2    Apr              27                37            38           25

Delete a row by viewing the index value - Example: Delete row "Total" which has an index value =5

In [111]:
df = df.drop(labels=5, axis=0)

View it again to see if row "Total" has been dropped successfully

In [112]:
df.sort_values('Months', ascending=False)

  Months  Region Midwest  Region Northeast  Region South  Region West
3    May              26                35            41           31
1    Mar              28                38            43           26
4    Jun              22                31            39           25
0    Feb              22                45            27           37
2    Apr              27                37            38           25

Create a new column we will call "Total" by sum all columns together

In [119]:
df['Total'] = df['Region Midwest'] + df['Region Northeast'] + df['Region South'] + df['Region West']

Display the first 10 rows of the data frame. Add a number in the parentheses and that number of rows will display.

In [121]:
df.head(10)

  Months  Region Midwest  Region Northeast  Region South  Region West  Total
0    Feb              22                45            27           37    131
1    Mar              28                38            43           26    135
2    Apr              27                37            38           25    127
3    May              26                35            41           31    133
4    Jun              22                31            39           25    117

Displays the last 10 rows of the data frame. Add a number in the parentheses and that number of rows will display.

In [122]:
df.tail(10)

  Months  Region Midwest  Region Northeast  Region South  Region West  Total
0    Feb              22                45            27           37    131
1    Mar              28                38            43           26    135
2    Apr              27                37            38           25    127
3    May              26                35            41           31    133
4    Jun              22                31            39           25    117

Displays row 0-4 of the data frame. Note, the data frame starts counting rows/columns at 0 instead of 1.

In [123]:
df.iloc[0:5]

  Months  Region Midwest  Region Northeast  Region South  Region West  Total
0    Feb              22                45            27           37    131
1    Mar              28                38            43           26    135
2    Apr              27                37            38           25    127
3    May              26                35            41           31    133
4    Jun              22                31            39           25    117

Outputs the data type of each column.(i.e. object, int32, datetime64...)

In [125]:
df.dtypes

Months              object
Region Midwest       int64
Region Northeast     int64
Region South         int64
Region West          int64
Total                int64
dtype: object

Identify duplicates in the data set.

In [126]:
df.drop_duplicates()

  Months  Region Midwest  Region Northeast  Region South  Region West  Total
0    Feb              22                45            27           37    131
1    Mar              28                38            43           26    135
2    Apr              27                37            38           25    127
3    May              26                35            41           31    133
4    Jun              22                31            39           25    117

Save the existing data frame as a new CSV file or save to json or excel using:

df.to_json('name_of_new_file.json')


df.to_excel('name_of_new_file.xlsx', index=False)

Note, index=False can be added to the other.

In [132]:
df.to_csv('data2.csv')